{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "name": "lambda_1", "batch_input_shape": [null, 160, 320, 3], "arguments": {}, "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u000emodel_hkkim.py\u00da\b<lambda>e\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "output_shape": [160, 320, 3], "trainable": true}}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_1", "cropping": [[50, 20], [0, 0]], "trainable": true}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "bias": true, "W_constraint": null, "b_constraint": null, "trainable": true, "activity_regularizer": null, "activation": "linear", "name": "convolution2d_1", "init": "glorot_uniform", "subsample": [2, 2], "nb_filter": 24, "dim_ordering": "tf", "b_regularizer": null, "nb_row": 5, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "nb_col": 5}}, {"class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "bias": true, "W_constraint": null, "b_constraint": null, "trainable": true, "activity_regularizer": null, "activation": "linear", "name": "convolution2d_2", "init": "glorot_uniform", "subsample": [2, 2], "nb_filter": 36, "dim_ordering": "tf", "b_regularizer": null, "nb_row": 5, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "nb_col": 5}}, {"class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "bias": true, "W_constraint": null, "b_constraint": null, "trainable": true, "activity_regularizer": null, "activation": "linear", "name": "convolution2d_3", "init": "glorot_uniform", "subsample": [2, 2], "nb_filter": 48, "dim_ordering": "tf", "b_regularizer": null, "nb_row": 5, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "nb_col": 5}}, {"class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "bias": true, "W_constraint": null, "b_constraint": null, "trainable": true, "activity_regularizer": null, "activation": "linear", "name": "convolution2d_4", "init": "glorot_uniform", "subsample": [1, 1], "nb_filter": 64, "dim_ordering": "tf", "b_regularizer": null, "nb_row": 3, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "nb_col": 3}}, {"class_name": "ELU", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "bias": true, "W_constraint": null, "b_constraint": null, "trainable": true, "activity_regularizer": null, "activation": "linear", "name": "convolution2d_5", "init": "glorot_uniform", "subsample": [1, 1], "nb_filter": 64, "dim_ordering": "tf", "b_regularizer": null, "nb_row": 3, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "nb_col": 3}}, {"class_name": "ELU", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "name": "dense_1", "init": "glorot_uniform", "input_dim": 8448, "b_regularizer": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "output_dim": 100}}, {"class_name": "ELU", "config": {"name": "elu_6", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"bias": true, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "name": "dense_2", "init": "glorot_uniform", "input_dim": 100, "b_regularizer": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "output_dim": 50}}, {"class_name": "ELU", "config": {"name": "elu_7", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"bias": true, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "name": "dense_3", "init": "glorot_uniform", "input_dim": 50, "b_regularizer": null, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "output_dim": 10}}, {"class_name": "ELU", "config": {"name": "elu_8", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "name": "dense_4", "init": "glorot_uniform", "input_dim": 10, "b_regularizer": null, "W_regularizer": null, "output_dim": 1}}], "keras_version": "1.2.2"}